Retrieve a forward moving iterator to the set.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public virtual RoofTypeSetIterator ForwardIterator()
  Visual Basic
Public Overridable Function ForwardIterator As RoofTypeSetIterator
  Visual C++
public:
virtual RoofTypeSetIterator^ ForwardIterator()
 Return Value
 Returns a forward moving iterator to the set.
 See Also
  RoofTypeSet Class
  Autodesk.Revit.DB Namespace